function fm = linearArrayfactor(eleNum,thetaRange,eleSpace,x)
%
% fm = linearArrayfactor(eleNum,thetaRange,eleSpace,x)
% eleNum:阵元数
% thetaRange:方向图观察角度范围
% eleSpace:阵元间距，归一化波长
% x:阵元上激励电流的幅度和相位，相位在前rad，幅度在后线性
%{
4.8GHz 16阵元线阵
波束1
pha1 = [8.23 -88.56 172.1 83.03 -3.11 -93.2 178.3 81.17 -10.37 -98.64 -178.19 93.72 -10.89 -86.26 -171.88 80.49];
mag1 = [0.202 0.197 0.175 0.184 0.179 0.214 0.246 0.25 0.262 0.247 0.228 0.266 0.214 0.188 0.178 0.214];
x1 = [deg2rad(pha1) mag1];
波束5
pha5 = [-167.59 -158.82 -138.87 -134.08 -116.03 -105.32 -92.66 -87.03 -71.31 -55.22 -38.3 -26.49 -11.34 5.55 11.24 28.27];
mag5 = [0.176 0.178 0.205 0.224 0.243 0.248 0.269 0.265 0.261 0.258 0.250 0.239 0.236 0.2 0.184 0.175];
x5 = [deg2rad(pha5) mag5];

4.32GHz 16阵元线阵 
波束1
pha1_L = [14.93 -59.47 -152.49 122.76 51.08 -58.74 -118.02 161.44 69.66 -10.99 -84.2 -166.68 105.09 28.6 -51.03 -145.89];
mag1_L = [0.142 0.227 0.205 0.276 0.199 0.175 0.221 0.255 0.263 0.213 0.165 0.233 0.214 0.176 0.189 0.157];
x1_L = [deg2rad(pha1_L) mag1_L];
波束5
pha5_L = [-115.62 -94.31 -69.03 -65.99 -63.92 -59.88 -45.6 -31.71 -19.4 -9.37 -2.26 23.08 45.66 43.58 53.24 74.81];
mag5_L = [0.176 0.205 0.199 0.175 0.138 0.176 0.234 0.239 0.251 0.247 0.227 0.192 0.193 0.205 0.202 0.148];
x5_L = [deg2rad(pha5_L) mag5_L];

5.28GHz 16元线阵
波束1
pha1_H = [-4.34 -104.73 152.74 56.92 -40.07 -152.07 99.01 -2.32 -92.36 167.85 76.65 -18.59 -133.77 139.95 48.88 -45.24];
mag1_H = [0.181 0.183 0.164 0.169 0.185 0.227 0.25 0.211 0.243 0.26 0.237 0.285 0.251 0.172 0.202 0.165];
x1_H = [deg2rad(pha1_H) mag1_H];
波束5
pha5_H = [127.13 141.72 155.1 170.32 -175.81 -159.37 -151.47 -137.5 -128.3 -106.52 -88.6 -73.12 -60.99 -42.54 -30.35 -16.1];
mag5_H = [0.143 0.188 0.207 0.24 0.264 0.262 0.28 0.284 0.267 0.286 0.267 0.248 0.241 0.217 0.177 0.143];
x5_H = [deg2rad(pha5_H) mag5_H];

plot(-90:90,20*log10(fm1),'k-',-90:90,20*log10(fm5),'k-.',-90:90,20*log10(fm1_L),'r-',-90:90,20*log10(fm5_L),'r-.',-90:90,20*log10(fm1_H),'b-',-90:90,20*log10(fm5_H),'b-.','LineWidth',2)
%}


fm = zeros(1,length(thetaRange));

for ii=1:eleNum
    fm = fm+x(ii+eleNum)*exp(1j*(ii-1)*2*pi*eleSpace*sind(thetaRange)+1j*x(ii));
end
 %fm = abs(fm)./max(abs(fm)); %归一化
 %figure
 %plot(thetaRange,20*log10(fm),'k-.','LineWidth',2) % decibal value
 %plot(thetaRange,fm,'b-')
%hold on

%{
D_theta = zeros(1,length(thetaRange));
for ii=1:length(thetaRange)
    if thetaRange(ii)<=-2
        D_theta(ii) = 0.001;
    elseif thetaRange(ii)<0
        D_theta(ii) = 0.4*thetaRange(ii)+0.8;
    elseif thetaRange(ii)<4
        D_theta(ii) = 0.05*thetaRange(ii)+0.8;
    elseif thetaRange(ii)<8
        D_theta(ii) = 1;
    elseif thetaRange(ii)<58
        D_theta(ii) = -0.01*thetaRange(ii)+1.08;
    else
        D_theta(ii) = 0.001;
    end
end
 plot(thetaRange,20*log10(D_theta),'r-')
 ylim([-50 0])
 plot(thetaRange,D_theta,'r-')

end
%}

% optimiztionX = [16.2333 172.3717 -117.6549 -162.0345 -24.2158 -37.9609 -102.4292 -99.0187...
%     -6.3424 -88.8941 68.3311 70.0410 131.9329 74.5378 26.5732 76.2868...
%     0.3696 0.7798 0.8206 0.6955 1.0000 1.0000 0.5534 0.4261...
%     0.6564 0.3807 0.0455 0.1865 0.3125 0.1814 0.1559 0.1640];